{
    "id":1,
    "type":"TextReveal",
    "details":
    {
        "summary":"From young my parents taught me the importance of preserving and continuing to learn and speak Spanish, that was a rule in our home. “At home we speak Spanish.” Although my brother and I would communicate in Spanglish, we continued to practice Spanish daily by watching TV shows and talking to our parents in Spanish.",
        "text":"From young my parents taught me the importance of preserving and continuing to learn and speak Spanish, that was a rule in our home. “At home we speak Spanish.” Although my brother and I would communicate in Spanglish, we continued to practice Spanish daily by watching TV shows and talking to our parents in Spanish. However, away from home and at school almost everything we handled in English. Apart from language there were also differences between customs and small details between the typical American culture and the culture of my family. It is much more difficult to navigate environments and relationships for someone who does not know 'how the current flows.' This is why it’s so valuable to know ourselves well and learn how the ideas and ways that we bring are perceived by other people; from the way we behave, dress, communicate, work, and even our expectations towards others. It is equally valuable and important to know the cultures of others. For me, understanding all that over time gave me an advantage in school, clubs, college, and even in my work because now I can adapt more easily to the people and environments that surround me. This was something I started to realized when I was young, during elementary school when I realized that somehow I had a double-personality or double-identity. I was Ruben at home with my family and close friends, but at school and out of the home I was Jose. My way of being and of thinking changed depending on where and with whom I was. Eventually I became more aware of these changes. Today my understanding of others and myself brings me ease and advantages that I would not have without this knowledge. Let’s take a look at the Latinx experience more closely!"
    }
}